"GIT_STATUS_UNTRACKED" = "This file is untracked.";
"GIT_STATUS_IGNORED" = "This file is ignored.";

"GIT_STATUS_MODIFIED_INDEX_M" = "modified in index";
"GIT_STATUS_MODIFIED_INDEX_A" = "added to index";
"GIT_STATUS_MODIFIED_INDEX_D" = "deleted from index";
"GIT_STATUS_MODIFIED_INDEX_R" = "renamed in index";
"GIT_STATUS_MODIFIED_INDEX_C" = "copied in index";

"GIT_STATUS_MODIFIED_WORKING_M" = "modified in work tree";
"GIT_STATUS_MODIFIED_WORKING_D" = "deleted from work tree";
